package com.livehereandnow.ages.card;

import java.util.ArrayList;
import java.util.HashSet;
import java.util.List;
import java.util.Set;
import javax.persistence.EntityManager;
import javax.persistence.EntityManagerFactory;
import javax.persistence.Persistence;

public class AgesCardFactory {

    private static final String PERSISTENCE_UNIT_NAME = "agesPU";
    private static EntityManagerFactory factory;
    private static EntityManager em;

    public AgesCardFactory() {
//        factory = Persistence.createEntityManagerFactory(PERSISTENCE_UNIT_NAME);
//        em = factory.createEntityManager();
    }

    public List<AgesCard> getAgeCivil(int age) {
        List<AgesCard> list = getAgesCardArrayList();
        List<AgesCard> newList = new ArrayList<>();
        AgesCard card;
        for (int k=0; k<list.size();k++){
            card=list.get(k);
            if (card.getAge()==age && card.getCivilMilitary().equals("內政")){
                newList.add(card);
                
            }
        }
        
//        for (AgesCard card : list) {
//            if (card.getCivilMilitary().endsWith("內政")) {
//                if (card.getAge() == age) {
//                    newList.add(card);
//                    list.remove(card);
//                }
//            }
//        }
        return newList;
    }
public List<AgesCard> getAgeMilitary(int age) {
        List<AgesCard> list = getAgesCardArrayList();
        List<AgesCard> newList = new ArrayList<>();
        AgesCard card;
        for (int k=0; k<list.size();k++){
            card=list.get(k);
            if (card.getAge()==age && card.getCivilMilitary().equals("軍事")){
                newList.add(card);
                
            }
        }
        
//        for (AgesCard card : list) {
//            if (card.getCivilMilitary().endsWith("內政")) {
//                if (card.getAge() == age) {
//                    newList.add(card);
//                    list.remove(card);
//                }
//            }
//        }
        return newList;
    }

    public List<AgesCard> getAgesCardArrayList() {
        List<AgesCard> ca = new ArrayList<>();
        //

        ca.add(new AgesCard(2548, 1001, "專制", 0, "內政", "政府", "", "", "+白點:4;+紅點:2;+房屋:2", "null", "橙色", 1, 0, 0, 0, 0, 4, 0, 2, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2549, 1002, "亞歷山大圖書館", 0, "內政", "奇蹟", "你可以額外保留一張內政牌一張軍事牌", "奇蹟石頭:1-2-2-1", "音樂:1;燈泡:1", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2550, 1003, "亞歷山大大帝", 0, "內政", "領袖", "每個軍事單位的力量加一", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2551, 1004, "亞里士多得", 0, "內政", "領袖", "每從排列獲得一張科技牌,就獲得一個科技點數", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2552, 1005, "人口的發展", 0, "軍事", "事件", "每個文明免費獲得一個人口", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2553, 1006, "軍事的發展", 0, "軍事", "事件", "每名玩家可以免費將一名閒置工人升級為軍事部隊", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2554, 1007, "農業", 0, "內政", "農場", "", "石頭:2", "食物:1", "null", "棕色", 1, 0, 0, 0, 0, 0, 1, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0));
        ca.add(new AgesCard(2555, 1008, "農業的發展", 0, "軍事", "事件", "每個文明生產兩個食物", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2556, 1009, "凱薩", 0, "內政", "領袖", "軍事力量+1 軍事行動 MA+1", "", "武器:1;+紅點:1", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2557, 1010, "哲學", 0, "內政", "實驗室", "", "石頭:3", "燈泡:1", "null", "灰色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0));
        ca.add(new AgesCard(2558, 1011, "宗教", 0, "內政", "神廟", "", "石頭:3", "音樂:1;笑臉:1", "null", "灰色", 1, 0, 0, 0, 0, 0, 0, 0, 1, 3, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0));
        ca.add(new AgesCard(2559, 1012, "宗教的發展", 0, "軍事", "事件", "每個玩家可以使用一個限制的工人免費修建寺廟", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2560, 1013, "富饒之土", 0, "內政", "行動", "少花費一個資源建造一個農場或礦場", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2561, 1014, "工程天才", 0, "內政", "行動", "本輪完成奇蹟的一步建設時少花費兩個資源", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2562, 1015, "巨人像", 0, "內政", "奇蹟", "殖民時獲得獎勵+1", "奇蹟石頭:3-3", "音樂:1;武器:1", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2563, 1016, "市場的發展", 0, "軍事", "事件", "每個文明生產兩個食物或兩個資源(玩家自行決定)", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2564, 1017, "建築工地", 0, "內政", "行動", "建築一座新的城市建築少花費一個資源", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2565, 1018, "戰士", 0, "內政", "步兵", "", "石頭:2", "武器:1", "null", "紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0));
        ca.add(new AgesCard(2566, 1019, "手工業的發展", 0, "軍事", "事件", "每個文明生產兩個資源", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2567, 1020, "摩西", 0, "內政", "領袖", "增加人口時少消耗一個食物", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2568, 1021, "政治的發展", 0, "軍事", "事件", "每個玩家可抽取三張軍事牌,當前玩家本輪不需要棄掉軍事牌", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2569, 1022, "無事件", 0, "軍事", "事件", "什麼都沒有發生", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2570, 1023, "漢摩拉比", 0, "內政", "領袖", "內政行動CA+1 軍事行動MA-1", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2571, 1024, "愛國主義", 0, "內政", "行動", "本輪獲得一個額外的軍事行動和一個額外的資源用於建造軍隊", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2572, 1025, "科技的發展", 0, "軍事", "事件", "每個文明獲得兩點科技點數", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2573, 1026, "空中花園", 0, "內政", "奇蹟", "", "奇蹟石頭:2-2-2", "音樂:1;笑臉:2", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 2, 0, 0, 0, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2574, 1027, "藝術作品", 0, "內政", "行動", "獲得六點文化分數", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2575, 1028, "節儉", 0, "內政", "行動", "以正常價格增加一個人口後,獲得一個食物", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2576, 1029, "荷馬", 0, "內政", "領袖", "每輪獲得一個額外資源用於建造軍隊,每個戰士每輪獲得一點文化(最多為兩點)", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2577, 1030, "貿易的發展", 0, "軍事", "事件", "每個文明獲得一個科技點數,生產一個食物和一個資源", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2578, 1031, "金字塔", 0, "內政", "奇蹟", "獲得一點內政行動", "奇蹟石頭:3-2-1", "+白點:1", "null", "紫色", 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2579, 1032, "青銅", 0, "內政", "礦山", "", "石頭:2", "石頭:1", "null", "棕色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0));
        ca.add(new AgesCard(2580, 1033, "革新思想", 0, "內政", "行動", "獲得一點科技點", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2581, 1036, "萬里長城", 1, "內政", "奇蹟", "每個步兵和砲兵有額外一點軍力加成", "奇蹟石頭:2-2-3-2", "音樂:1;笑臉:1", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2582, 1038, "豐收", 1, "內政", "行動", "獲得兩個食物", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2583, 1039, "兵家必爭之地", 1, "軍事", "領土", "", "軍事牌:3", "武器:2", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2584, 1041, "戰爭機構", 1, "內政", "軍事", "軍力+1 軍事行動+1", "燈泡:4", "武器:1;+紅點:1", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 4, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0));
        ca.add(new AgesCard(2585, 1043, "製圖術", 1, "內政", "殖民", "軍力+1 殖民時額外獲得兩點軍力(同種特殊科技只能擁有一張)", "燈泡:4", "武器:1;", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0));
        ca.add(new AgesCard(2586, 1046, "十字軍東征", 1, "軍事", "事件", "軍力最強的文明獲得四點文明分數,軍力最弱的文民失去四點文明分數", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2587, 1047, "卡羅琳娜大學", 1, "內政", "奇蹟", "", "奇蹟石頭:3-3-3", "音樂:1;燈泡:2", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 2, 0, 0, 0, 0, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2588, 1049, "歷史悠久之地", 1, "軍事", "領土", "", "音樂:6", "笑臉:1", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 6, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6));
        ca.add(new AgesCard(2589, 1051, "叛亂", 1, "軍事", "事件", "每擁有一個不幸福的工人,下回合將減少兩個內政行動", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2590, 1052, "君主制", 1, "內政", "政府", "", "和平燈炮:9;革命燈泡:3", "+白點:5;+紅點:3;+房屋:3", "null", "橙色", 1, 0, 0, 0, 0, 5, 0, 3, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 3, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2591, 1055, "哥倫布", 1, "內政", "領袖", "你可以在政治行動中直接打出並殖民一塊殖民地不需要犧牲任何軍隊(此能力只能使用一次)", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2592, 1056, "聖女貞德", 1, "內政", "領袖", "神殿每個笑臉給予軍力+1", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2593, 1057, "聖彼得大教堂", 1, "內政", "奇蹟", "所有幸福指數加倍", "奇蹟石頭:4-4", "音樂:2", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2594, 1060, "好收成", 1, "軍事", "事件", "每個文明的農田立即生產一輪忽略消耗和腐敗", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2595, 1062, "富饒肥沃之地", 1, "軍事", "領土", "", "食物:3", "+黃點:3", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0));
        ca.add(new AgesCard(2596, 1063, "工程天才", 1, "內政", "行動", "少花費三個資源來完成奇蹟的一步建設", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2597, 1064, "巴巴羅薩", 1, "內政", "領袖", "你可以使用一個內政行動擴充一個人口並建造軍隊少花費一糧食和一礦", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2598, 1067, "恐怖地區", 1, "軍事", "事件", "軍事最弱的文民失去一個人口", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2599, 1069, "成吉思汗", 1, "內政", "領袖", "忽略己方戰術牌,騎兵+1軍力+1文明", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2600, 1071, "文化的影響", 1, "軍事", "事件", "文明獲得其每輪增加的文明分數", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2601, 1072, "新的礦藏", 1, "軍事", "事件", "所有玩家的礦井立即生產一輪無視消耗和腐敗", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2602, 1074, "有人居住之地", 1, "軍事", "領土", "", "擴充人口:1", "+黃點:2", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2603, 1075, "法典", 1, "內政", "內政", "獲得一點內政行動", "", "+白點:1", "null", "藍色", 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2604, 1076, "泰姬陵", 1, "內政", "奇蹟", "", "奇蹟石頭:2-4-2", "音樂:3", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2605, 1079, "愛國主義", 1, "內政", "行動", "本輪獲得額外一個軍事行動,額外兩個資源建造軍隊", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2606, 1080, "物資豐富之地", 1, "軍事", "領土", "", "石頭:5", "+藍點:2", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0));
        ca.add(new AgesCard(2607, 1081, "瘟疫", 1, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2608, 1082, "石工學", 1, "內政", "建築", "你的等級 I II III 的城市建築少花費1/1/1個資源,你可以用一個內政行動興建奇蹟的兩步(同種特殊科技只能擁有一張)", "", "", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2609, 1083, "礦藏", 1, "內政", "行動", "你的文明生產兩個資源", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2610, 1085, "神權政治", 1, "內政", "政府", "", "和平燈炮:7;革命燈泡:2", "+白點:4;+紅點:3;+房屋:3;笑臉:2", "null", "橙色", 1, 0, 0, 0, 0, 4, 0, 3, 0, 0, 0, 2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 2, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2611, 1086, "科技先進之地", 1, "軍事", "領土", "", "燈泡:3", "+黃點:1;+藍點:1", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0));
        ca.add(new AgesCard(2612, 1087, "科技突破", 1, "軍事", "事件", "所有文明按照其科技指數得到科技點數", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2613, 1088, "移民", 1, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2614, 1089, "突破", 1, "內政", "行動", "全價研發一項科技，然後獲得兩點科技點", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2615, 1091, "米開朗基羅", 1, "內政", "領袖", "神殿，劇院和奇蹟的每個笑臉每輪提供，額外一點文化分數，少花費一個內政行動拿奇蹟", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2616, 1092, "藝術作品", 1, "內政", "行動", "獲得五點文化分數", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2617, 1093, "節儉", 1, "內政", "行動", "以正常價格增加一個人口後,獲得兩個食物", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2618, 1094, "蠻族入侵", 1, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2619, 1096, "邊境衝突", 1, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2620, 1097, "達文西", 1, "內政", "領袖", "你最好的實驗室或圖書館，按照其等級生產額外科技，你每打一張科技牌時，獲得一個資源", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2621, 1100, "革新思想", 1, "內政", "行動", "獲得二點科技點", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2622, 1101, "領土糾紛", 1, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2623, 1104, "鼠疫", 1, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2624, 1107, "豐收", 2, "內政", "行動", "獲得三個食物", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2625, 1108, "破碎的偶像", 2, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2626, 1109, "克里姆林宮", 2, "內政", "奇蹟", "", "奇蹟石頭:4-4-4", "音樂:3;笑臉:-2;+白點:1;+紅點:1", "null", "紫色", 1, 0, 0, 0, 0, 1, 0, 1, 3, 0, 0, -2, 0, 0, 0, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2627, 1110, "共和制", 2, "內政", "政府", "", "和平燈炮:14;革命燈泡:4", "+白點:7;+紅點:2;+房屋:3", "null", "橙色", 1, 0, 0, 0, 0, 7, 0, 2, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 4, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2628, 1111, "兵家必爭之地", 2, "軍事", "領土", "", "軍事牌:5", "武器:4", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2629, 1113, "冷戰", 2, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2630, 1114, "刺殺", 2, "軍事", "侵略", "", "", "", "null", "深棕色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2631, 1115, "歷史悠久之地", 2, "軍事", "領土", "", "音樂:11", "笑臉:2", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 11, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11));
        ca.add(new AgesCard(2632, 1116, "古典陣型", 2, "軍事", "戰術", "", "步:2;馬:2", "武器:9;過期武器:4", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 4, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2633, 1117, "司法系統", 2, "內政", "內政", "獲得一點內政行動，", "", "+白點:1;+藍點:3", "null", "藍色", 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2634, 1118, "君主立憲制", 2, "內政", "政府", "", "和平燈炮:12;革命燈泡:5", "+白點:6;+紅點:4;+房屋:3", "null", "橙色", 1, 0, 0, 0, 0, 6, 0, 4, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 5, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2635, 1119, "吞併", 2, "軍事", "侵略", "", "消耗紅點:2", "", "null", "深棕色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(2636, 1120, "團隊競技", 2, "內政", "競技場", "", "燈泡:5;石頭:6", "武器:2;笑臉:3", "null", "灰色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 6, 5, 3, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 5, 0, 0));
        ca.add(new AgesCard(2637, 1123, "艾菲爾鐵塔", 2, "內政", "奇蹟", "", "奇蹟石頭:3-7-3", "音樂:4;笑臉:1", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 1, 0, 0, 0, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2638, 1126, "富饒肥沃之地", 2, "軍事", "領土", "", "食物:5", "+黃點:4", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0));
        ca.add(new AgesCard(2639, 1127, "工程天才", 2, "內政", "行動", "少花費四個資源來完成奇蹟的一步建設", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2640, 1128, "巴哈", 2, "內政", "領袖", "打出劇場科技少花費一科技，劇場建設少花費一資源，每個劇場多生產一點文明", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2641, 1129, "市民暴動", 2, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2642, 1130, "庫克船長", 2, "內政", "領袖", "", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2643, 1131, "建築學", 2, "內政", "建築", "你的等級 I II III 的城市建築少花費1/2/2個資源,你可以用一個內政行動興建奇蹟的三步(同種特殊科技只能擁有一張)", "", "", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2644, 1133, "恐怖主義", 2, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2645, 1134, "戰略", 2, "內政", "軍事", "軍力+3 軍事行動+2", "燈泡:8", "武器:3;+紅點:2", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 2, 0, 0, 8, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 0, 0));
        ca.add(new AgesCard(2646, 1135, "拿破崙", 2, "內政", "領袖", "獲得一個軍事行動，最強大的集團軍戰術獎勵加倍", "", "+紅點:1", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2647, 1136, "拿破崙陣型", 2, "軍事", "戰術", "", "步:1;馬:1;炮:1", "武器:8;過期武器:4", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 4, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2648, 1139, "文化戰爭", 2, "軍事", "戰爭", "", "消耗紅點:3", "", "null", "黑色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0));
        ca.add(new AgesCard(2649, 1141, "時間的洪流", 2, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2650, 1142, "有人居住之地", 2, "軍事", "領土", "", "擴充人口:2", "+黃點:3", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2651, 1143, "機動部隊", 2, "軍事", "戰術", "", "馬:1;炮:1", "武器:5", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2652, 1145, "民族主義浪潮", 2, "內政", "行動", "", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2653, 1146, "民族的自豪", 2, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2654, 1147, "洲際鐵路", 2, "內政", "奇蹟", "", "奇蹟石頭:3-4-5", "武器:5", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2655, 1148, "火槍兵", 2, "內政", "步兵", "", "燈泡:5;石頭:5", "武器:3", "null", "紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 0, 0));
        ca.add(new AgesCard(2656, 1150, "煤礦", 2, "內政", "礦山", "", "燈泡:7;石頭:8", "石頭:3", "null", "棕色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 3, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 7, 0, 0));
        ca.add(new AgesCard(2657, 1152, "牛頓", 2, "內政", "領袖", "你最好的實驗室或圖書館，按照其等級生產額外科技，你每打一張科技牌時，回收一點內政點數", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2658, 1153, "物資豐富之地", 2, "軍事", "領土", "", "石頭:8", "+藍點:3", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 8, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 0, 0, 0));
        ca.add(new AgesCard(2659, 1154, "獨立宣言", 2, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2660, 1155, "胸甲騎兵", 2, "內政", "騎兵", "", "燈泡:6;石頭:5", "武器:3", "null", "紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 5, 6, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 6, 0, 0));
        ca.add(new AgesCard(2661, 1157, "破壞", 2, "軍事", "侵略", "", "", "", "null", "深棕色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2662, 1160, "科技戰爭", 2, "軍事", "戰爭", "", "消耗紅點:2", "", "null", "黑色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(2663, 1161, "科技領先之地", 2, "軍事", "領土", "", "燈泡:5", "+黃點:2;+藍點:2", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0));
        ca.add(new AgesCard(2664, 1162, "科普教育", 2, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2665, 1163, "移民出境", 2, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2666, 1164, "突破", 2, "內政", "行動", "全價研發一項科技，然後獲得四點科技點", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2667, 1167, "經濟發展", 2, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2668, 1168, "羅伯斯比爾", 2, "內政", "領袖", "獲得一個軍是行動，革命消耗你所有的軍是行動而不是內政行動", "", "+紅點:1", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2669, 1169, "罪惡之都", 2, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2670, 1170, "航海術", 2, "內政", "殖民", "軍力+2 殖民時額外獲得三點軍力(同種特殊科技只能擁有一張)", "燈泡:6", "武器:2;", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 0, 0));
        ca.add(new AgesCard(2671, 1171, "藝術作品", 2, "內政", "行動", "獲得四點文化分數", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2672, 1172, "節儉", 2, "內政", "行動", "以正常價格增加一個人口後,獲得三個食物", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2673, 1173, "莎士比亞", 2, "內政", "領袖", "圖書館額外產生一點文明，圖書館+劇院的組合，額外產生兩點文明分數", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2674, 1175, "資源戰爭", 2, "軍事", "戰爭", "", "消耗紅點:2", "", "null", "黑色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(2675, 1176, "遠洋客運", 2, "內政", "奇蹟", "", "奇蹟石頭:3-2-2-2-3", "", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2676, 1177, "選種培育", 2, "內政", "農場", "", "燈泡:5;石頭:6", "食物:3", "null", "棕色", 1, 0, 0, 0, 0, 0, 3, 0, 0, 6, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 5, 0, 0));
        ca.add(new AgesCard(2677, 1179, "防禦工事", 2, "軍事", "戰術", "", "炮:2", "武器:4;", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2678, 1181, "難民", 2, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2679, 1182, "革新思想", 2, "內政", "行動", "獲得四點科技點", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2680, 1183, "領土戰爭", 2, "軍事", "戰爭", "", "消耗紅點:3", "", "null", "黑色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0));
        ca.add(new AgesCard(2681, 1184, "高效升級", 2, "內政", "行動", "", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2682, 1185, "F14", 3, "內政", "領袖", "所有實驗室每等級產生一點文明分數，所有實驗室少生產一點科技", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2683, 1186, "邱吉爾", 3, "內政", "領袖", "部隊的科技牌少3點科技，防禦牌效果加倍，當有人對你宣戰時，軍對的建設費用減少兩點", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2684, 1188, "豐收", 3, "內政", "行動", "獲得四個食物", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2685, 1189, "人口的影響", 3, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2686, 1190, "公共服務", 3, "內政", "內政", "", "", "+白點:2;+藍點:3", "null", "藍色", 1, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2687, 1191, "共產主義", 3, "內政", "政府", "", "和平燈炮:17;革命燈泡:6", "+白點:7;+紅點:5;+房屋:4;笑臉:-1", "null", "橙色", 1, 0, 0, 0, 0, 7, 0, 5, 0, 0, 0, -1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17, 6, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2688, 1193, "軍事建設", 3, "內政", "行動", "", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2689, 1194, "軍事倫理", 3, "內政", "軍事", "軍力+5 軍事行動+3", "燈泡:12", "武器:5;+紅點:3", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 3, 0, 0, 12, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 0, 0));
        ca.add(new AgesCard(2690, 1195, "軍力的影響", 3, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2691, 1196, "農業的影響", 3, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2692, 1197, "衛星", 3, "內政", "殖民", "軍力+3 殖民時額外獲得四點軍力(同種特殊科技只能擁有一張)", "燈泡:8", "武器:3;", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 0, 0));
        ca.add(new AgesCard(2693, 1198, "歷史進程的影響", 3, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2694, 1199, "原教旨主義", 3, "內政", "政府", "", "和平燈炮:19;革命燈泡:7", "+白點:6;+紅點:5;+房屋:4;武器:5", "null", "橙色", 1, 0, 0, 0, 0, 6, 0, 5, 0, 0, 0, 0, 4, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 19, 7, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2695, 1201, "因特網", 3, "內政", "奇蹟", "", "奇蹟石頭:2-3-4-3-2", "", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2696, 1203, "聖戰", 3, "軍事", "戰爭", "", "消耗紅點:3", "", "null", "黑色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0));
        ca.add(new AgesCard(2697, 1204, "甘地", 3, "內政", "領袖", "你無法打出侵略或戰爭牌，期他玩家對你的侵略或戰爭需要花費兩倍的軍是點數", "", "音樂:2", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2698, 1205, "坦克", 3, "內政", "騎兵", "", "燈泡:9;石頭:7", "武器:5", "null", "紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 7, 9, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 9, 0, 0));
        ca.add(new AgesCard(2699, 1207, "奇蹟的影響", 3, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2700, 1209, "好萊烏", 3, "內政", "奇蹟", "", "奇蹟石頭:5-6-5", "", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2701, 1210, "尼古拉特斯拉", 3, "內政", "領袖", "所有實驗室按等級生產資源，其他玩家在建造或升級，他們的實驗室或圖書館需要花費額外一個資源", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2702, 1211, "工業的影響", 3, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2703, 1212, "工程天才", 3, "內政", "行動", "少花費五個資源來完成奇蹟的一步建設", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2704, 1213, "工程學", 3, "內政", "建築", "你的等級 I II III 的城市建築少花費1/2/3個資源,你可以用一個內政行動興建奇蹟的四步(同種特殊科技只能擁有一張)", "", "", "null", "藍色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2705, 1214, "幸福的影響", 3, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2706, 1215, "建築工地", 3, "內政", "行動", "建設一個新的城市建築少支付四個資源", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2707, 1216, "建築的影響", 3, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2708, 1217, "快餐連鎖", 3, "內政", "奇蹟", "", "奇蹟石頭:4-4-4-4", "", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2709, 1218, "戰壕", 3, "軍事", "戰術", "", "步:1;炮:2", "武器:9:過期武器:5", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 1, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2710, 1219, "技術的影響", 3, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2711, 1220, "掠奪", 3, "軍事", "侵略", "侵略成功時,受害方:失去八個食物資源,侵略方:獲得同等食物資源(總計八個)", "消耗紅點:3", "", "null", "深棕色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0));
        ca.add(new AgesCard(2712, 1221, "政府的影響", 3, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2713, 1223, "機械化農業", 3, "內政", "農場", "", "燈泡:7;石頭:8", "食物:5", "null", "棕色", 1, 0, 0, 0, 0, 0, 5, 0, 0, 8, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 7, 0, 0));
        ca.add(new AgesCard(2714, 1224, "機械化部隊", 3, "軍事", "戰術", "", "馬:1;炮:2", "武器:10;過期武器:5", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5, 0, 0, 0, 0, 0, 1, 2, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2715, 1226, "殖民地的影響", 3, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2716, 1227, "民主制", 3, "內政", "政府", "", "和平燈炮:21;革命燈泡:8", "+白點:7;+紅點:3;+房屋:4;音樂:2", "null", "橙色", 1, 0, 0, 0, 0, 7, 0, 3, 2, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 21, 8, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2717, 1229, "愛因斯坦", 3, "內政", "領袖", "你最好的實驗室或圖書館，按照其等級生產額外科技，你每打一張科技牌時，獲得三點文明分數", "", "", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2718, 1230, "愛國主義", 3, "內政", "行動", "", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2719, 1231, "現代化步兵", 3, "內政", "步兵", "", "燈泡:7;石頭:7", "武器:5", "null", "紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 7, 7, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 7, 0, 0));
        ca.add(new AgesCard(2720, 1232, "現代化軍隊", 3, "軍事", "戰術", "", "步:2;馬:1;炮:1", "武器:13;過期武器:7", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 7, 0, 0, 2, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2721, 1234, "石油", 3, "內政", "礦山", "", "燈泡:9;石頭:11", "石頭:5", "null", "棕色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 5, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 9, 0, 0));
        ca.add(new AgesCard(2722, 1235, "礦床", 3, "內政", "行動", "你的文明生產四個資源", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2723, 1236, "科學的影響", 3, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2724, 1237, "空軍", 3, "內政", "空軍", "", "", "武器:5", "null", "紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2725, 1238, "空間飛行", 3, "內政", "奇蹟", "", "奇蹟石頭:3-4-9", "", "null", "紫色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98765, 0, 0, 98765, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2726, 1240, "競爭力的影響", 3, "軍事", "事件", "", "", "", "null", "深綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2727, 1241, "約翰藍儂", 3, "內政", "領袖", "獲得兩個額外的笑臉，你最好的劇院產生，兩倍的文明分數", "", "笑臉:2", "null", "綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2728, 1242, "職業競技", 3, "內政", "競技場", "", "燈泡:7;石頭:8", "武器:3;笑臉:4", "null", "灰色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 8, 7, 4, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 7, 0, 0));
        ca.add(new AgesCard(2729, 1243, "藝術作品", 3, "內政", "行動", "獲得三點文化分數", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2730, 1244, "藝術捐獻", 3, "內政", "行動", "", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2731, 1246, "閃電戰", 3, "軍事", "戰術", "", "步:1;馬:3", "武器:11;過期武器:6", "null", "深紅色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 6, 0, 0, 1, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2732, 1247, "革命性理念", 3, "內政", "行動", "獲得六點科技點", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2733, 1248, "高效升級", 3, "內政", "行動", "", "", "", "null", "黃色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2734, 1257, "突襲", 1, "軍事", "事件", "", "", "", "null", "淺綠色", 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2803, 1044, "劍士", 1, "內政", "步兵", "", "燈泡:3;石頭:3", "武器:2", "null", "紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 3, 3, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 3, 0, 0));
        ca.add(new AgesCard(2804, 1048, "印刷術", 1, "內政", "圖書館", "", "燈泡:3;石頭:4", "音樂:1;燈泡:1", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 1, 4, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 3, 0, 0));
        ca.add(new AgesCard(2805, 1053, "河蟹娛樂", 1, "內政", "競技場", "", "燈泡:3;石頭:4", "武器:1;笑臉:2", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 4, 3, 2, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 3, 0, 0));
        ca.add(new AgesCard(2806, 1059, "奴役", 1, "軍事", "侵略", "侵略成功時,受害方:失去一個人口,侵略方:獲得三個資源", "消耗紅點:2", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(2807, 1061, "富饒之土", 1, "內政", "行動", "少花費兩個資源來建造一個新的農場或礦井", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2808, 1065, "建築工地", 1, "內政", "行動", "建設一個新的城市建築少支付兩個資源", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2809, 1068, "戲劇", 1, "內政", "劇院", "", "燈泡:4;石頭:5", "音樂:2;笑臉:1", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 2, 5, 4, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 4, 0, 0));
        ca.add(new AgesCard(2810, 1070, "掠奪", 1, "軍事", "侵略", "侵略成功時,受害方:失去三個食物資源,侵略方:獲得同等食物資源(總計三個)", "消耗紅點:2", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(2811, 1073, "方陣", 1, "軍事", "戰術", "", "步:2;馬:1", "武器:3", "null", "深紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 2, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2812, 1077, "灌溉", 1, "內政", "農場", "", "燈泡:3;石頭:4", "食物:2", "null", "棕色", 2, 0, 0, 0, 0, 0, 2, 0, 0, 4, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 3, 0, 0));
        ca.add(new AgesCard(2813, 1078, "煉金術", 1, "內政", "實驗室", "", "燈泡:4;石頭:6", "燈泡:2", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 6, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 4, 0, 0));
        ca.add(new AgesCard(2814, 1084, "神學", 1, "內政", "神廟", "", "燈泡:2;石頭:5", "音樂:1;笑臉:2", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 1, 5, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 2, 0, 0));
        ca.add(new AgesCard(2815, 1090, "突襲", 1, "軍事", "侵略", "", "消耗紅點:2", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(2816, 1095, "輕騎兵", 1, "軍事", "戰術", "", "馬:2", "武器:2", "null", "深紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2817, 1098, "重騎兵", 1, "軍事", "戰術", "", "馬:3", "武器:4", "null", "深紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2818, 1099, "鐵礦", 1, "內政", "礦山", "", "燈泡:5;石頭:5", "石頭:2", "null", "棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 2, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 0, 0));
        ca.add(new AgesCard(2819, 1102, "騎士", 1, "內政", "騎兵", "", "燈泡:4;石頭:3", "武器:2", "null", "紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 3, 4, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 4, 0, 0));
        ca.add(new AgesCard(2820, 1103, "高效升級", 1, "內政", "行動", "", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2821, 1125, "富饒之土", 2, "內政", "行動", "少花費三個資源來建造一個新的農場或礦井", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2822, 1132, "建築工地", 2, "內政", "行動", "建設一個新的城市建築少支付三個資源", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2823, 1137, "掠奪", 2, "軍事", "侵略", "侵略成功時,受害方:失去五個食物資源,侵略方:獲得同等食物資源(總計五個)", "消耗紅點:2", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(2824, 1140, "新聞業", 2, "內政", "圖書館", "", "燈泡:6;石頭:8", "音樂:2;燈泡:2", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 2, 8, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 6, 0, 0));
        ca.add(new AgesCard(2825, 1144, "歌劇", 2, "內政", "劇院", "", "燈泡:7;石頭:9", "音樂:3;笑臉:1", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 3, 9, 7, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 7, 0, 0));
        ca.add(new AgesCard(2826, 1149, "火砲", 2, "內政", "炮兵", "", "燈泡:7;石頭:5", "武器:3", "null", "紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 5, 7, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 7, 0, 0));
        ca.add(new AgesCard(2827, 1151, "愛國主義", 2, "內政", "行動", "", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2828, 1156, "礦藏", 2, "內政", "行動", "你的文明生產三個資源", "", "", "null", "黃色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2829, 1158, "科學方法", 2, "內政", "實驗室", "", "燈泡:6;石頭:8", "燈泡:3", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 8, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 6, 0, 0));
        ca.add(new AgesCard(2830, 1165, "突襲", 2, "軍事", "侵略", "", "消耗紅點:2", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0));
        ca.add(new AgesCard(2831, 1166, "組織化宗教", 2, "內政", "神廟", "", "燈泡:4;石頭:7", "音樂:1;笑臉:3", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 1, 7, 4, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 4, 0, 0));
        ca.add(new AgesCard(2832, 1174, "西班牙陣型", 2, "軍事", "戰術", "", "步:1;馬:2", "武器:5;過期武器:3", "null", "深紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 3, 0, 0, 1, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2833, 1178, "間諜", 2, "軍事", "侵略", "侵略成功時,受害方:失去最多五點科技,侵略方:獲得相同科技點數", "", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2834, 1180, "防禦陣型", 2, "軍事", "戰術", "", "步:2;炮:1", "武器:6;過期武器:3", "null", "深紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 3, 0, 0, 2, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2835, 1206, "多媒體", 3, "內政", "圖書館", "", "燈泡:9;石頭:11", "音樂:3;燈泡:3", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 3, 11, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 9, 0, 0));
        ca.add(new AgesCard(2836, 1222, "文化戰爭", 3, "軍事", "戰爭", "", "消耗紅點:3", "", "null", "黑色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0));
        ca.add(new AgesCard(2837, 1228, "火箭", 3, "內政", "炮兵", "", "燈泡:10;石頭:7", "武器:5", "null", "紅色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 7, 10, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 10, 0, 0));
        ca.add(new AgesCard(2838, 1233, "電影", 3, "內政", "劇院", "", "燈泡:10;石頭:12", "音樂:4;笑臉:1", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 4, 12, 10, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 10, 0, 0));
        ca.add(new AgesCard(2839, 1239, "突襲", 3, "軍事", "侵略", "", "消耗紅點:3", "", "null", "深棕色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0));
        ca.add(new AgesCard(2840, 1245, "計算機", 3, "內政", "實驗室", "", "燈泡:8;石頭:10", "燈泡:5", "null", "灰色", 2, 0, 0, 0, 0, 0, 0, 0, 0, 10, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 8, 0, 0));
        ca.add(new AgesCard(2866, 1037, "中世紀軍隊", 1, "軍事", "戰術", "", "步:1;馬:1", "武器:2", "null", "深紅色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2867, 1040, "兵陣", 1, "軍事", "戰術", "", "步:2", "", "null", "深紅色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2868, 1042, "軍團", 1, "軍事", "戰術", "", "步:3", "武器:2", "null", "深紅色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2869, 1225, "武裝入侵", 3, "軍事", "侵略", "", "消耗紅點:2", "", "null", "深棕色", 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2873, 1058, "防禦卡", 1, "軍事", "獎勵", "防禦+2 殖民+1", "", "", "null", "雙色", 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2874, 1208, "防禦卡", 3, "軍事", "獎勵", "防禦+6 殖民+3", "", "", "null", "雙色", 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));
        ca.add(new AgesCard(2876, 1124, "防禦卡", 2, "軍事", "獎勵", "防禦+4 殖民+2", "", "", "null", "雙色", 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0));

        return ca;
    }

    private AgesCardArrayList XXXgetAgesCardArrayList() {
        AgesCardArrayList ca = new AgesCardArrayList();
        List<AgesCard> src = em.createNamedQuery("CardBank.findAll").getResultList();
        for (AgesCard one : src) {
            ca.add(one);
        }
        return ca;
    }
}
